In [1]:
import pandas as pd
import pandasai as pdai
from pandasai.llm.openai import OpenAI
from pandasai import PandasAI

In [2]:
path = '/mnt/c/Users/GiovanniPalazzo/Downloads/Output Apr2023.xlsx'
data = pd.read_excel(path)
data

,Unnamed: 0,aux_data_run,data,cod_age,data_inizio,data_fine,n_accessi_situazione_cliente,n_accessi_scheda_cliente_leonardo
0,0,23/05/2023,01/04/2023,10650,14/03/2023,NaN,11,4
1,1,23/05/2023,03/04/2023,10650,14/03/2023,NaN,71,25
2,2,23/05/2023,04/04/2023,10650,14/03/2023,NaN,76,30
3,3,23/05/2023,05/04/2023,10650,14/03/2023,NaN,86,15
4,4,23/05/2023,06/04/2023,10650,14/03/2023,NaN,94,19
...,...,...,...,...,...,...,...,...
36346,36346,23/05/2023,17/04/2023,72930,14/03/2023,NaN,1,0
36347,36347,23/05/2023,19/04/2023,72930,14/03/2023,NaN,3,0
36348,36348,23/05/2023,21/04/2023,72930,14/03/2023,NaN,3,0
36349,36349,23/05/2023,24/04/2023,72930,14/03/2023,NaN,1,0
36350,36350,23/05/2023,28/04/2023,72930,14/03/2023,NaN,1,0

In [3]:
llm = OpenAI(api_token="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")

In [4]:
pandas_ai = PandasAI(llm)

In [8]:
pandas_ai(
    data,
    "Plot the stacked bar chart of cod_age showing for each n_accessi_situazione_cliente and n_accessi_scheda_cliente_leonardo,\
    using different colors for each bar. Take into account only the first 10 cod_ages ordered by n_accessi_situazione_cliente decreasing"
)

'Sure, I can help you with that! To create a stacked bar chart of cod_age, we need to consider two variables: n_accessi_situazione_cliente and n_accessi_scheda_cliente_leonardo. We will use different colors for each bar. However, we will only take into account the first 10 cod_ages ordered by n_accessi_situazione_cliente decreasing.'

In [10]:
tst = pandas_ai.run(data, 
    prompt=f"""What are the first 10 cod_age ordered by n_accessi_situazione_cliente descending?Provide also the overall sum of n_accessi_situazione_cliente. Format the result as HTML table.""")
tst

"The first 10 cod_age ordered by n_accessi_situazione_cliente descending are all 39331. The overall sum of n_accessi_situazione_cliente is 3679594. Here's the result formatted as an HTML table."

Not stable:

In [11]:
tst_2 = pandas_ai(
    data,
    "What are the first 10 cod_age ordered by n_accessi_situazione_cliente descending?",
)

tst_2

'The top 10 cod_age based on the highest number of n_accessi_situazione_cliente are: [insert list here].'

In [ ]:
pandas_ai.run(data, prompt='When we had the highest value of n_accessi_situazione_cliente? And for n_accessi_scheda_cliente_leonardo?')

In [ ]:
pandas_ai.run(data, prompt='Can you compute the grouped value by date of the average of n_accessi_situazione_cliente ?')

In [ ]:
tst_3 = pandas_ai(
    data,
    "Return a dataframe with the grouped values by date of the average of n_accessi_situazione_cliente"
)

In [ ]:
tst_3

In [ ]:
pandas_ai(
    data,
    "Where is the dataframe requested in the previous question?"
)

In [ ]:
pandas_ai(
    data,
    "Can you provide a short description of the dataset and its columns?"
)

In [ ]:
tst_4 = pandas_ai(
    data,
    "Generate a dataframe with the grouped values by date of the average of n_accessi_situazione_cliente"
)
tst_4

In [ ]:
pandas_ai(
    data,
    "Yes please, show the code!"
)

keep into account some limitations:

    - That model is currently overloaded with other requests.
    - token (more or less 4000) limits

In [5]:
tst_5 = pandas_ai(
    data,
    "Show a code in order to get a dataframe with the grouped values by date of the average of n_accessi_situazione_cliente. The column with the date is named 'data'. Provide it as Python code delimited by quotes."
)
tst_5

'To get a dataframe with the grouped values by date of the average of n_accessi_situazione_cliente, you can use the following Python code: "grouped_df = df.groupby(\'data\')[\'n_accessi_situazione_cliente\'].mean()". This will group the data by the \'data\' column and calculate the mean of the \'n_accessi_situazione_cliente\' column for each date. The resulting dataframe will have two columns: \'data\' and \'n_accessi_situazione_cliente\', where the latter contains the average values.'

I had to specify the date column, prevously it used 'data inizio'

In [ ]:
pandas_ai(
    data,
    "And the very same code computed for n_accessi_scheda_cliente_leonardo?",
)

Does not take into account the previous question!

In [ ]:
data.groupby('data')['n_accessi_situazione_cliente'].mean()

 Feeling Lazy? Italian works as well!

In [ ]:
pandas_ai(
    data,
    "Qual Ã¨ la cod_age con il piÃ¹ alto valore di accesso a situazione cliente? In che data?"
)

In [ ]:
pandas_ai(
    data,
    "Qual Ã¨ la cod_age con il piÃ¹ alto valore di accesso a situazione cliente e Leonardo? In che date rispettivamente?"
)

In [ ]:
pandas_ai(
    data,
    "Qual Ã¨ la cod_age con il piÃ¹ alto valore di accesso ai due portali monitorati? In che date rispettivamente?"
)

In [10]:
pandas_ai(
    data,
    "Compute the sum of n_accessi_scheda_cliente_leonardo, grouped by cod_age.\
    Return only the first 10 rows, ordered by the sum of n_accessi_scheda_cliente_leonardo descending.\
    Provide the result in JSON format with the following keys: cod_age, num_access."
)

'Sure, I can help you with that! To compute the sum of n_accessi_scheda_cliente_leonardo grouped by cod_age, we can use the SQL query: \n\nSELECT cod_age, SUM(n_accessi_scheda_cliente_leonardo) AS num_access \nFROM your_table_name \nGROUP BY cod_age \nORDER BY num_access DESC \nLIMIT 10;\n\nThis will give us the top 10 rows ordered by the sum of n_accessi_scheda_cliente_leonardo in descending order. We can then provide the result in JSON format with the keys "cod_age" and "num_access".'

In [12]:
data_cleaned = pdai.impute_missing_values(data)
data_cleaned

AttributeError: module 'pandasai' has no attribute 'impute_missing_values'